README.org
#+TITLE: README.org
#+AUTHOR: Kurihara Yoshiki
#+DATE: 2018-09-03
#+LANGUAGE: ja
#+STARTUP: hidestars inlineimages
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/lib/js/jquery.stickytableheaders.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/readtheorg/js/readtheorg.js"></script>

* Tweet検索スクリプト
  指定した検索ワードでTwitterを検索して、スクリプト実行時以降に該当のツイートがあったら内容をLINEに通知してくれる

** 使用準備
   [[https://notify-bot.line.me/ja/][LINE notify API]]と[[https://developer.twitter.com/][Twitter API]]からアクセストークンをもらってくる

   以下のようなconfig.pyを用意
   #+BEGIN_SRC python
   CONSUMER_KEY = 'Twitter APIのCONSUMER KEY'
   CONSUMER_SECRET = 'Twitter APIのCONSUMER SECRET KEY'
   ACCESS_TOKEN = 'Twitter APIのACCESS TOKEN'
   ACCESS_TOKEN_SECRET = 'Twitter APIのACCESS TOKEN SECRET'

   LINE_ACCESS_TOKEN = "LINE notify APIのアクセストークン"
   #+END_SRC
   
   pipで以下をinstall
   - requests
   - argparse
   - requests-oauthlib

** 実行方法
   以下のように実行
   #+BEGIN_SRC bash
   ./main.py -q "検索クエリ"
   #+END_SRC
   
** その他
   - 5分に一回該当ツイートを最新から5つ取ってくるので、5分の間に5個以上該当ツイートが投稿されていると追えない
   - デフォルトで"日本語のツイート"かつ"リツイートでないもの"しか対象としていない、設定を変えたかったら以下を変更
	 #+BEGIN_SRC python
	 query = query + " exclude:retweets lang:ja"
	 #+END_SRC
